# print("Hello, World") - вывод на экран
# name = input()
# print("Привет, " + name + "!")
# print(type(name))
# int - integer, целое число, 
# float - число с плавающей точкой, 3.14
# str - string, строка
# Python - язык с динамической типизацией
# input - функция возвращает строки, чтобы при вводе было int задаём a = int(input())
# Арифметические операции + - / * сложение, вычитание, деление, умножение; // целочисленное деление; ** возведение в степень; abs(x) вывести модуль числа
# and логический оператор И; or логический оператор ИЛИ; not логический оператор НЕ