    # Теория Python
# print("Hello, World") - вывод на экран значения внутри "", print (s, w) - вывод поочерёдно переменных s и w
# print("Привет, " + name + "!") - вывод на экран совместно с переменной
# print(type(name)) - вывести тип переменной name
# name = input() - ввод данных(строки) с клавиатуры, которое будёт присвоено переменной name
# b = int(input("b = ")) - ввод целочисленного числа b с клавиатуры от пользователя и помещение в переменную b
    # Типы переменных: int - integer, целое число, float - число с плавающей точкой, 3.14, 
# str - string, строка; bool - логический тип данных (True/False)
    # Python - язык с динамической типизацией, нет ограничения по битам для хранения числа
# int() - функция, которая позволяет перевести из любого типа данных в число (если это возможно)
# str() - функция, которая позволяет перевести из любого типа данных в строку (если это возможно)
# float() - функция, которая позволяет перевести из любого типа данных в вещественный (если это возможно)
# input - функция возвращает строки, чтобы при вводе было int задаём a = int(input())
    # Работа с числами: n = int(input()) - ввод числа с клавиатуры
# Арифметические операции + - / * сложение, вычитание, деление (вещественных чисел), умножение;  
# ** возведение в степень; abs(x) вывести модуль числа; % остаток от деления; // целочисленное деление;
# round(x, 5) - округление числа до пятой цифры после запятой
    # Сокращения математических операций:
# m +=3 аналогично m = m + 3
# m -=3 аналогично m = m - 3
# m *=3 аналогично m = m * 3
# m /=3 аналогично m = m / 3
# m %=3 аналогично m = m % 3
# m //=3 аналогично m = m // 3
# m **=3 аналогично m = m ** 3
    # Логические операции:
# and логический оператор И; or логический оператор ИЛИ; not логический оператор НЕ
# > Больше, >= Больше или равно, < Меньше, <= Меньше или равно, == Равно ли (True), != Равно ли (False)
    # Циклы:
# n = int(input()) 
# if n % 2 == 0 and n % 3 ==0:
    # print('Чило кратно 6')
# else:
    # print('Число не кратно 6)